Autodesk.Revit.DB.PhaseFilter.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new phase filter with default status presentation.
Remarks:
The default status presentation is ShowByCategory for New status, and ShowOverriden for Existing,
Demolished and Temporary statuses.
document:
The document.
name:
The name.
Returns:
The newly created phase filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is already in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PhaseFilter.SetPhaseStatusPresentation(Autodesk.Revit.DB.ElementOnPhaseStatus,Autodesk.Revit.DB.PhaseStatusPresentation)
Sets the phase status presentation.
status:
The element phase status.
presentation:
The phase status presentation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
status is invalid for presentation query.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.PhaseFilter.GetPhaseStatusPresentation(Autodesk.Revit.DB.ElementOnPhaseStatus)
Gets the phase status presentation.
status:
The element phase status.
Returns:
The phase status presentation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
status is invalid for presentation query.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.PhaseFilter.IsDefault
Indicates whether this filter is the default one.
Since:
2013

Autodesk.Revit.DB.PhaseFilter
Represents an phase filter within Autodesk Revit.
Since:
2013